In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
filename = '../data/sat-scores.csv'

df = pd.read_csv(filename,
                usecols=['Year', 'State.Code', 'Total.Math', 'Total.Test-takers', 'Total.Verbal'],
                index_col=['Year', 'State.Code'])
df.head()

                 Total.Math  Total.Test-takers  Total.Verbal
Year State.Code
2005 AL                 559               3985           567
     AK                 519               3996           523
     AZ                 530              18184           526
     AR                 552               1600           563
     CA                 522             186552           504

In [3]:
df.loc[(2010, ['NY', 'NJ', 'MA', 'IL']), 'Total.Math'].mean()

535.25

In [4]:
# How many people took the SAT, total, in 2005?
df.loc[2005, 'Total.Test-takers'].sum()

1344824

In [5]:
# What was the average SAT math score in 2010 from New York, New Jersey, Massachusetts, and Illinois?
df.loc[(2010, ['NY', 'NJ', 'MA', 'IL']), 'Total.Math'].mean()

535.25

In [7]:
# What was the average SAT verbal score in 2012-2015 from Arizona, California, and Texas?
df.loc[([2012,2013,2014,2015], ['AZ', 'CA', 'TX']), 'Total.Math'].mean()

511.5833333333333